doc/pull-request.org
* Pull Request

** Types of pull request

*** Type one: Changes to the code base

    These pull request are changes to any file that deals with logic and
    function of the plugin. These include but are not limited to: 
      * new features
      * bug fixes
      * documentation changes

**** Rules
      1. Anyone in the community can make these pull requests
      2. The pull request needs to:
         * Pass all tests through jenkins
         * Have at least two approvals from maintainers


*** Type two: Dependency changes

    For now we have decided that the sovrin-plugin will work on the latest stable
    builds of its dependencies (this can change if necessary).

**** Rules

     1. Anyone in the community can make these pull requests
     2. The pull request needs to:
        * have a clearly-documented explanation of why versions should change
        * Pass all tests through jenkins
        * Have _all_ maintainers approve of the change


*** Type three: Changes to Devops

    This includes changes to any files in the devops folder. Please note that
    the community should not make changes to these files because they are for
    internal use only.

**** Rules

     1. Only internal entities should make these pull requests
     2. The pull request needs to:
        * Pass all tests through jenkins
        * Have at least 2 maintainers approve of the change


** Approving changes

*** What is the approval process?

     1. A maintainer must thoroughly read and consider the impact of proposed
     changes
     2. A maintainer must address any concerns left in the comments section
     2. A maintainer must check that all tests pass in the jenkins environment
     3. A maintainer must test the changes on his local machine and make sure that
     all tests pass using the _plugin_ /indy_pool/
